---
kind: method
id: M:Autodesk.Revit.DB.ElementDesignOptionFilter.#ctor(Autodesk.Revit.DB.ElementId)
source: html/417ab643-8266-ee2f-45aa-9da8c1784c70.htm
---
# Autodesk.Revit.DB.ElementDesignOptionFilter.#ctor Method

Constructs a new instance of a filter to match elements contained within a particular design option.

## Syntax (C#)
```csharp
public ElementDesignOptionFilter(
	ElementId designOptionId
)
```

## Parameters
- **designOptionId** (`Autodesk.Revit.DB.ElementId`) - The design option id to match.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null